HelpDesk/src/InformationRegisters/ФлагиПисем/ФлагиПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФлагиПисем</name>
  <resources>
    <name>Флаг</name>
    <type>
      <types>EnumRef.ФлагиПисем</types>
    </type>
  </resources>
  <dimensions>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HelpDesk/src/InformationRegisters/ФлагиПисем/ManagerModule.bsl
// Делает запись в регистр.
//
Процедура УстановитьФлаг(Письмо, Пользователь, Флаг) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Флаг = Флаг;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Очищает запись.
//
Процедура ОчиститьФлаг(Письмо, Пользователь) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Получает значение ресурса Флаг для измерений регистра Письмо, Пользователь.
//
Функция ПолучитьФлаг(Письмо, Пользователь) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Возврат Запись.Флаг;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Если у письма установлен флаг то очищает его,
// иначе устанавливает.
Процедура ПереключитьФлаг(Письмо, Пользователь, Флаг) Экспорт
	
	Запись = РегистрыСведений.ФлагиПисем.СоздатьМенеджерЗаписи();
	Запись.Письмо = Письмо;
	Запись.Пользователь = Пользователь;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Запись.Удалить();
	Иначе
		Запись.Письмо = Письмо;
		Запись.Пользователь = Пользователь;
		Запись.Флаг = Флаг;
		Запись.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры
